aTanguay/Enssemble.io/AmyBoard/NSMBL_Bridge/sdkconfig.defaults
# Target — AMYboard (ESP32-S3)
CONFIG_IDF_TARGET="esp32s3"

# Bluetooth (NimBLE, peripheral only)
CONFIG_BT_ENABLED=y
CONFIG_BT_NIMBLE_ENABLED=y
CONFIG_BT_NIMBLE_ROLE_PERIPHERAL=y
CONFIG_BT_NIMBLE_ROLE_CENTRAL=n
CONFIG_BT_NIMBLE_ROLE_OBSERVER=n
CONFIG_BT_NIMBLE_ROLE_BROADCASTER=n
CONFIG_BT_NIMBLE_MAX_CONNECTIONS=1

# Main task stack
CONFIG_ESP_MAIN_TASK_STACK_SIZE=8192

# Logging
CONFIG_LOG_DEFAULT_LEVEL_INFO=y

# Console on the S3's native USB (USB-Serial-JTAG) so logs are visible over the
# same USB-C used to flash. DIN MIDI is on UART1 (GPIO14/21) — a different
# peripheral entirely — so there is no console/MIDI collision here.
CONFIG_ESP_CONSOLE_UART_DEFAULT=n
CONFIG_ESP_CONSOLE_USB_SERIAL_JTAG=y
CONFIG_ESP_CONSOLE_SECONDARY_NONE=y
